[
  "```json\n{\n  \"beginning\": \"About twelve years ago there was an election anticipated in the Borough of N----... She also voluntarily admitted, in a very clever way, several of her own frailties.\",\n  \"rising_action\": \"In order to explain the nature of the case I should, however, remark... having sufficiently ascertained even a tolerably sufficient reason for it.\",\n  \"climax\": \"However, the judge thought the trial should be postponed for a day... but whomsoever she should select from among her tried and best friends.\",\n  \"falling_action\": \"After the trial had been postponed, and the exciseman had... And I was ultimately able to devise what I then thought, and still think, my greatest Electioneering Trick.\"\n}\n```",
  "```json\n{\n  \"beginning\": \"The beings stood around my bed in air suits like ski suits, with globes over their heads like upside-down fishbowls... I recognize people and whether I am going to like this person or that person by something in the way they move and how they get excited when they talk.\",\n  \"rising_action\": \"I am not the only survivor--they have explained that--but I am the first they found, and the least damaged... They are polite, so polite I almost feel they are afraid of me, and I want to reassure them.\",\n  \"climax\": \"A rabbity one who is closer than the others backs away, gesturing politely that he is giving room for someone else to speak... 'You were about to come out into space. We were wondering how to hide!'\",\n  \"falling_action\": \"The human race will be a good partner to these races... I could kill them all.\"\n}\n```",
  "```json\n{\n  \"beginning\": \"MATILDA’S ears were red and shiny... The people made it fast with anchors, and then every one went to bed, thanking the kind fate which had sent them so great a Princess to help them in their need, and calling her the saviour of her country and the bulwark of the nation.\",\n  \"rising_action\": \"But it is poor work being the nation’s bulwark... He climbed up to the window.\",\n  \"climax\": \"“Now,” said he, “if I can do what your father asks, will you marry me?”... The good Roman cement and a double coat of magenta paint doesn’t keep it quiet nothing will.\",\n  \"falling_action\": \"So he gave orders, and the stone was carted... I hope I’m not too early,” said he. “Your Majesty,” she answered.\"\n}\n```",
  "Here's the story segmented into beginning, rising action, climax, and falling action in JSON format:\n\n```json\n{\n  \"beginning\": \"Old Mother West Wind’s family is very big, very big indeed... returned it would be full of the things he liked best.\",\n  \"rising_action\": \"Then all the little meadow people and forest folks sat down around... didn’t know it and doesn’t know it to this day, he went right across the doorstep of Striped Chipmunk’s home.\",\n  \"climax\": \"Reddy Fox was furious. Twice more he sprang... together to shout and laugh and dance and roll over and over on the mossy green bank.\",\n  \"falling_action\": \"Johnny Chuck chuckled to himself, for he was happy... And since that day Peter Rabbit has been prouder than ever of his big cousin, Jumper the Hare, for now no one calls him a coward.\"\n}\n```"
]